const eventsRawData = [
  {
    "Id": 1,
    "Name": "Бази на податоци",
    "Description": "Испит за предметот Бази на податоци во јануарската сесија. Термин 1: 09:00 - 11:00.",
    "Type": "exam",
    "StartTime": "2025-01-15T09:00:00",
    "EndTime": "2025-01-15T11:00:00",
    "Location": "Лаб 138",
    "Longitude": 21.410342723917818,
    "Latitude": 42.004660898511595
  },
  {
    "Id": 2,
    "Name": "Програмирање на видео игри",
    "Description": "Испит за предметот Програмирање на видео игри во јануарската сесија. Термин 2: 13:00 - 16:00.",
    "Type": "exam",
    "StartTime": "2025-01-18T13:00:00",
    "EndTime": "2025-01-18T16:00:00",
    "Location": "Лаб 13",
    "Longitude": 21.409887725814826,
    "Latitude": 42.004934647481214
  },
  {
    "Id": 3,
    "Name": "Калкулус 2",
    "Description": "Испит за предметот Калкулус 2 во јануарската сесија.",
    "Type": "exam",
    "StartTime": "2025-01-16T14:00:00",
    "EndTime": "2025-01-16T17:00:00",
    "Location": "Барака 2.2",
    "Longitude": 21.4065184,
    "Latitude": 42.0046504
  },
  {
    "Id": 4,
    "Name": "Алгоритми и податочни структури",
    "Description": "Четврта лабораториска вежба по предметот Алгоритми и податочни структури.",
    "Type": "lab",
    "StartTime": "2025-01-17T08:30:00",
    "EndTime": "2025-01-17T14:30:00",
    "Location": "Лаб 215",
    "Longitude": 21.409924952932254,
    "Latitude": 42.00483648219667
  },
  {
    "Id": 5,
    "Name": "Менаџмент информациски системи",
    "Description": "Испит за предметот Менаџмент информациски системи во јануарската сесија. Термин 1: 10:00 - 10:45.",
    "Type": "exam",
    "StartTime": "2025-01-18T10:00:00",
    "EndTime": "2025-01-18T10:45:00",
    "Location": "ПФ Амфитеатар",
    "Longitude": 21.405532836914062,
    "Latitude": 42.00009536743164
  },
  {
    "Id": 6,
    "Name": "Веб програмирање",
    "Description": "Испит за предметот Веб програмирање во јануарската сесија.",
    "Type": "exam",
    "StartTime": "2025-01-20T09:30:00",
    "EndTime": "2025-01-20T15:30:00",
    "Location": "Лаб 2",
    "Longitude": 21.409728476478787,
    "Latitude": 42.004744175954364
  }
];
